import os

CHANNEL_ID = -69166063752457
MAX_BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")
BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")

# --- ССЫЛКИ ---
CHANNEL_URL = "https://max.ru/id3015020968_gos"
SITE_URL = "https://school-grace.astrobl.ru"
FORM_URL = "https://pos.gosuslugi.ru/landing/"

# --- ТЕКСТЫ ---
TEXT_SUBSCRIBE = (
    "Для того чтобы продолжить использовать бот, необходимо подписаться на канал"
    "«ГБУ ДО АО «СШОР им. Л.А. Тихомировой».\n\n"
    "Для этого нажмите «Открыть канал» или перейдите по ссылке:\n"
    f"{CHANNEL_URL}\n\n"
    "Затем вернитесь в чат-бот и нажмите «Я подписан»."
)

TEXT_WELCOME = (
    "Добро пожаловать в чат-бот «ГБУ ДО АО «СШОР им. Л.А. Тихомировой»!\n\n"
    "Выберите нужную категорию:"
)

TEXT_ABOUT = (
    "О художественной гимнастике\n"
)

TEXT_ADDRESSES = (
    "📍 **Адреса мест проведения учебно-тренировочных занятий**\n"
    "• г. Астрахань, ул. Советская, зд. 21\n"
    "• г. Астрахань, ул. Н. Островского, стр. 148е, помещение 9\n\n"
)

TEXT_PAID_SERVICES = (
    "💳 **Платные услуги**\n\n"
    "Здесь описаны платные услуги центра. Подробнее — на официальном сайте."
)

TEXT_CONTACTS = (
    "📞 **Справочная информация**\n\n"
    "• Телефон учебной части: +7 (8512) 51-14-07\n"
    "• Телефон вахты: +7 (8512) 51-90-09\n"
    "• Email: official@sshortihomirova.astrobl.ru\n"
    "• Режим работы: пн–сб, 7:30–20:30"
)

TEXT_SUPPORT_MENU = (
    "❓ **Часто задаваемые вопросы**\n\n"
    "Выберите направление:"
)

SUPPORT_DATA = {
    "question_1": (
        "✅ **Ответ:**\n\n"
        "На физкультурно-оздоровительную программу на платной основе принимаются девочки с 3,5–4 лет.\n"
    ),
    "question_2": (
        "✅ **Ответ:**\n\n"
        "В учреждении реализуются:\n"
        "• дополнительная образовательная программа спортивной подготовки по виду спорта «художественная гимнастика»;\n"
        "• дополнительная общеразвивающая программа физкультурно-спортивной направленности.\n"
    ),
    "question_3": (
        "✅ **Ответ:**\n\n"
        "По художественной гимнастике.\n"
    ),
    "question_4": (
        "✅ **Ответ:**\n\n"
        "Два направления:\n"
        "• спортивная подготовка по художественной гимнастике;
        "• общеразвивающая программа физкультурно-спортивной направленности.\n"
    ),
}
