import os

CHANNEL_ID = -69166063752457
MAX_BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")
BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")

# --- ССЫЛКИ ---
CHANNEL_URL = "https://max.ru/id3015020968_gos"
SITE_URL = "https://school-grace.astrobl.ru"
FORM_URL = "https://pos.gosuslugi.ru/landing/"

# --- ТЕКСТЫ ---
TEXT_SUBSCRIBE = (
    "Для того чтобы продолжить использовать бот, необходимо подписаться на канал"
    "«ГБУ ДО АО «СШОР им. Л.А. Тихомировой».\n\n"
    "Для этого нажмите «Открыть канал» или перейдите по ссылке:\n"
    f"{CHANNEL_URL}\n\n"
    "Затем вернитесь в чат-бот и нажмите «Я подписан»."
)

TEXT_WELCOME = (
    "Добро пожаловать в чат-бот «ГБУ ДО АО «СШОР им. Л.А. Тихомировой»!\n\n"
    "Выберите нужную категорию:"
)

TEXT_ABOUT = (
    "О художественной гимнастике\n"
)

TEXT_ADDRESSES = (
    "📍 **Адреса мест проведения учебно-тренировочных занятий**\n"
    "• г. Астрахань, ул. Советская, зд. 21\n"
    "• г. Астрахань, ул. Н. Островского, стр. 148е, помещение 9\n\n"
)

TEXT_PAID_SERVICES = (
    "💳 **Платные услуги**\n\n"
    "Здесь описаны платные услуги центра. Подробнее — на официальном сайте."
)

TEXT_CONTACTS = (
    "📞 **Справочная информация**\n\n"
    "• Телефон: +7 (8512) 51-14-07\n"
    "• Email: official@sshortihomirova.astrobl.ru\n"
    "• Режим работы: пн–сб, 7:30–20:30"
)

TEXT_SUPPORT_MENU = (
    "🎖️ **Часто задаваемые вопросы**\n\n"
    "Выберите направление:"
)

SUPPORT_DATA = {
    "volleyball": (
        "🏐 **Волейбол сидя**\n\n"
        "Для ветеранов и участников СВО\n"
        "Среда 18:00-20:00\n"
        "Пятница 18:00-20:00\n"
        "Воскресенье 18:00-20:00\n"
        "📍ФОК ГАУ АО «РЦСП «Каспий»\n"
        "ул. Джона Рида, 43\n"
        "Все подробности по телефону: +79033476746"
    ),
    "backgammon": (
        "🎲 **Нарды без границ**\n\n"
        "Для ветеранов и участников СВО\n"
        "Среда 18:00-20:00\n"
        "Пятница 18:00-20:00\n"
        "Воскресенье 18:00-20:00\n"
        "📍ФОК ГАУ АО «РЦСП «Каспий»\n"
        "ул. Джона Рида, 43\n"
        "Все подробности по телефону: +79033476746"
    ),
    "fitness": (
        "🧘 **Мягкий фитнес**\n\n"
        "Для семей участников СВО\n"
        "(для жен, матерей и детей героев СВО)\n"
        "Понедельник 18:00-19:00\n"
        "Среда 18:00-19:00\n"
        "Пятница 18:00-19:00\n"
        "📍ФОК ГАУ АО «РЦСП «Каспий»"
        "ул. Джона Рида, 43\n"
        "Все подробности по телефону: +79033476746"
    ),
    "table_tennis": (
        "🏓 **Настольный теннис**\n\n"
        "Для ветеранов и участников СВО\n"
        "Среда 18:00-20:00\n"
        "Пятница 18:00-20:00\n"
        "Воскресенье 18:00-20:00\n"
        "📍ФОК ГАУ АО «РЦСП «Каспий»\n"
        "ул. Джона Рида, 43\n"
        "Все подробности по телефону: +79033476746"
    ),
    "knife_throwing": (
        "🎯 **Метание ножей**\n\n"
        "Для ветеранов и участников СВО\n"
        "Вторник 10:00-12:00\n"
        "Четверг 16:00-18:00\n"
        "Воскресенье 15:00-17:00\n"
        "📍ГАУ АО «РЦСП «Каспий»\n"
        "г. Астрахань,ул. Красная Набережная, 168\n"
        "Все подробности по телефону: +79033476746"
    ),
}
